# 07. 종합을 위한 그룹화, 필터링 그리고 변환

In [1]:
import pandas as pd

flights = pd.read_csv("../data/flights.csv")
flights.head()

,MONTH,DAY,WEEKDAY,AIRLINE,ORG_AIR,DEST_AIR,SCHED_DEP,DEP_DELAY,AIR_TIME,DIST,SCHED_ARR,ARR_DELAY,DIVERTED,CANCELLED
0,1,1,4,WN,LAX,SLC,1625,58.0,94.0,590,1905,65.0,0,0
1,1,1,4,UA,DEN,IAD,823,7.0,154.0,1452,1333,-13.0,0,0
2,1,1,4,MQ,DFW,VPS,1305,36.0,85.0,641,1453,35.0,0,0
3,1,1,4,AA,DFW,DCA,1555,7.0,126.0,1192,1935,-7.0,0,0
4,1,1,4,WN,LAX,MCI,1720,48.0,166.0,1363,2225,39.0,0,0

In [2]:
flights.groupby("AIRLINE").agg({"ARR_DELAY": "mean"}).head()

         ARR_DELAY
AIRLINE
AA        5.542661
AS       -0.833333
B6        8.692593
DL        0.339691
EV        7.034580

In [3]:
flights.groupby("AIRLINE")["ARR_DELAY"].agg("mean").head()

AIRLINE
AA    5.542661
AS   -0.833333
B6    8.692593
DL    0.339691
EV    7.034580
Name: ARR_DELAY, dtype: float64

In [4]:
flights.groupby("AIRLINE")["ARR_DELAY"].mean().head()

AIRLINE
AA    5.542661
AS   -0.833333
B6    8.692593
DL    0.339691
EV    7.034580
Name: ARR_DELAY, dtype: float64

In [5]:
flights.groupby(["AIRLINE", "WEEKDAY"])["CANCELLED"].agg("sum").head()

AIRLINE  WEEKDAY
AA       1          41
         2           9
         3          16
         4          20
         5          18
Name: CANCELLED, dtype: int64

In [6]:
flights.groupby(["AIRLINE", "WEEKDAY"])["CANCELLED","DIVERTED"].agg("sum").head()

                 CANCELLED  DIVERTED
AIRLINE WEEKDAY
AA      1               41         6
        2                9         2
        3               16         2
        4               20         5
        5               18         1

In [7]:
flights.groupby(["AIRLINE", "WEEKDAY"])["CANCELLED","DIVERTED"].agg(["sum", "mean","std"]).head()

                CANCELLED                     DIVERTED
                      sum      mean       std      sum      mean       std
AIRLINE WEEKDAY
AA      1              41  0.032106  0.176352        6  0.004699  0.068411
        2               9  0.007341  0.085399        2  0.001631  0.040373
        3              16  0.011949  0.108698        2  0.001494  0.038633
        4              20  0.015004  0.121613        5  0.003751  0.061153
        5              18  0.014151  0.118160        1  0.000786  0.028039

In [8]:
flights.groupby(["AIRLINE", "WEEKDAY"])["CANCELLED","DIVERTED"].agg({"CANCELLED": ["sum", "mean","std"], "DIVERTED": ["sum"]}).head()

                CANCELLED                     DIVERTED
                      sum      mean       std      sum
AIRLINE WEEKDAY
AA      1              41  0.032106  0.176352        6
        2               9  0.007341  0.085399        2
        3              16  0.011949  0.108698        2
        4              20  0.015004  0.121613        5
        5              18  0.014151  0.118160        1

In [9]:
airline_info = flights.groupby(["AIRLINE", "WEEKDAY"]).agg({"DIST": ["sum", "mean"], "ARR_DELAY": ["min", "max"]})
airline_info

                    DIST              ARR_DELAY
                     sum         mean       min    max
AIRLINE WEEKDAY
AA      1        1455386  1139.691464     -60.0  551.0
        2        1358256  1107.876020     -52.0  725.0
        3        1496665  1117.748320     -45.0  473.0
        4        1452394  1089.567892     -46.0  349.0
        5        1427749  1122.444182     -41.0  732.0
...                  ...          ...       ...    ...
WN      3         997213   782.127843     -38.0  262.0
        4        1024854   810.802215     -52.0  284.0
        5         981036   816.849292     -44.0  244.0
        6         823946   834.798379     -41.0  290.0
        7         945679   819.479203     -45.0  261.0

[98 rows x 4 columns]

In [10]:
level0 = airline_info.columns.get_level_values(0)
level0

Index(['DIST', 'DIST', 'ARR_DELAY', 'ARR_DELAY'], dtype='object')

In [11]:
level1 = airline_info.columns.get_level_values(1)

level1

Index(['sum', 'mean', 'min', 'max'], dtype='object')

In [12]:
airline_info.columns = level0 + "_" + level1
airline_info

                 DIST_sum    DIST_mean  ARR_DELAY_min  ARR_DELAY_max
AIRLINE WEEKDAY
AA      1         1455386  1139.691464          -60.0          551.0
        2         1358256  1107.876020          -52.0          725.0
        3         1496665  1117.748320          -45.0          473.0
        4         1452394  1089.567892          -46.0          349.0
        5         1427749  1122.444182          -41.0          732.0
...                   ...          ...            ...            ...
WN      3          997213   782.127843          -38.0          262.0
        4         1024854   810.802215          -52.0          284.0
        5          981036   816.849292          -44.0          244.0
        6          823946   834.798379          -41.0          290.0
        7          945679   819.479203          -45.0          261.0

[98 rows x 4 columns]

In [13]:
airline_info.reset_index()

   AIRLINE  WEEKDAY  DIST_sum    DIST_mean  ARR_DELAY_min  ARR_DELAY_max
0       AA        1   1455386  1139.691464          -60.0          551.0
1       AA        2   1358256  1107.876020          -52.0          725.0
2       AA        3   1496665  1117.748320          -45.0          473.0
3       AA        4   1452394  1089.567892          -46.0          349.0
4       AA        5   1427749  1122.444182          -41.0          732.0
..     ...      ...       ...          ...            ...            ...
93      WN        3    997213   782.127843          -38.0          262.0
94      WN        4   1024854   810.802215          -52.0          284.0
95      WN        5    981036   816.849292          -44.0          244.0
96      WN        6    823946   834.798379          -41.0          290.0
97      WN        7    945679   819.479203          -45.0          261.0

[98 rows x 6 columns]

In [14]:
college = pd.read_csv("../data/college.csv")
college.groupby("STABBR")["UGDS"].agg(["mean", "std"]).round(0).head()

          mean      std
STABBR
AK      2493.0   4052.0
AL      2790.0   4658.0
AR      1644.0   3143.0
AS      1276.0      NaN
AZ      4130.0  14894.0

In [15]:
def max_deviation(s):
    std_score = (s - s.mean()) / s.std()
    return std_score.abs().max()

In [16]:
college.groupby("STABBR")["UGDS"].agg(max_deviation).round(0).head()

STABBR
AK     3.0
AL     6.0
AR     6.0
AS     NaN
AZ    10.0
Name: UGDS, dtype: float64

In [17]:
college.groupby("STABBR")["UGDS", "SATVRMID"].agg(max_deviation).round(0).head()

        UGDS  SATVRMID
STABBR
AK       3.0       NaN
AL       6.0       2.0
AR       6.0       2.0
AS       NaN       NaN
AZ      10.0       2.0

In [18]:
college.groupby("STABBR")["UGDS"].agg([max_deviation, "mean"]).round(0).head()

        max_deviation    mean
STABBR
AK                3.0  2493.0
AL                6.0  2790.0
AR                6.0  1644.0
AS                NaN  1276.0
AZ               10.0  4130.0

In [19]:
max_deviation.__name__

'max_deviation'

In [20]:
max_deviation.__name__ = "MAX Deviation"
college.groupby("STABBR")["UGDS"].agg([max_deviation, "mean"]).round(0).head()

        MAX Deviation    mean
STABBR
AK                3.0  2493.0
AL                6.0  2790.0
AR                6.0  1644.0
AS                NaN  1276.0
AZ               10.0  4130.0

In [21]:
import inspect
grouped = college.groupby(["STABBR", "RELAFFIL"])

inspect.signature(grouped.agg)

In [22]:
def pct_between_1_3k(s):
    return s.between(1000, 3000).mean()

grouped["UGDS"].agg(pct_between_1_3k).head()

STABBR  RELAFFIL
AK      0           0.142857
        1           0.000000
AL      0           0.236111
        1           0.333333
AR      0           0.279412
Name: UGDS, dtype: float64

In [23]:
def pct_between(s, low, high):
    return s.between(low, high).mean()

grouped["UGDS"].agg(pct_between, 1000, 30000).head()

STABBR  RELAFFIL
AK      0           0.571429
        1           0.000000
AL      0           0.541667
        1           0.375000
AR      0           0.411765
Name: UGDS, dtype: float64

In [24]:
grouped = college.groupby(["STABBR", "RELAFFIL"])
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [25]:
print([attr for attr in dir(grouped)])

['CITY', 'CURROPER', 'DISTANCEONLY', 'GRAD_DEBT_MDN_SUPP', 'HBCU', 'INSTNM', 'MD_EARN_WNE_P10', 'MENONLY', 'PCTFLOAN', 'PCTPELL', 'PPTUG_EF', 'RELAFFIL', 'SATMTMID', 'SATVRMID', 'STABBR', 'UG25ABV', 'UGDS', 'UGDS_2MOR', 'UGDS_AIAN', 'UGDS_ASIAN', 'UGDS_BLACK', 'UGDS_HISP', 'UGDS_NHPI', 'UGDS_NRA', 'UGDS_UNKN', 'UGDS_WHITE', 'WOMENONLY', '__annotations__', '__class__', '__class_getitem__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__len__', '__lt__', '__module__', '__ne__', '__new__', '__orig_bases__', '__parameters__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__slots__', '__str__', '__subclasshook__', '__weakref__', '_accessors', '_agg_examples_doc', '_agg_general', '_aggregate', '_aggregate_frame', '_aggregate_item_by_item', '_aggregate_multiple_funcs', '_apply_allowlist', '_apply_filter', '_apply_to_column_groupbys', '_assure_grouper', '_bool_agg', '_builtin_table', '_choose_path', '_concat_objects', '_constructor', '_cumcount_array', '_cython_agg_blocks', '_cython_agg_general', '_cython_table', '_cython_transform', '_define_paths', '_deprecations', '_dir_additions', '_dir_deletions', '_fill', '_get_cython_func', '_get_cythonized_result', '_get_data_to_aggregate', '_get_index', '_get_indices', '_gotitem', '_group_selection', '_insert_inaxis_grouper_inplace', '_internal_names', '_internal_names_set', '_is_builtin_func', '_is_protocol', '_iterate_column_groupbys', '_iterate_slices', '_make_wrapper', '_obj_1d_constructor', '_obj_with_exclusions', '_python_agg_general', '_python_apply_general', '_reindex_output', '_reset_cache', '_reset_group_selection', '_selected_obj', '_selection', '_selection_list', '_selection_name', '_set_group_selection', '_set_result_index_ordered', '_transform_fast', '_transform_general', '_transform_item_by_item', '_transform_should_cast', '_try_aggregate_string_function', '_wrap_agged_blocks', '_wrap_aggregated_output', '_wrap_applied_output', '_wrap_frame_output', '_wrap_transformed_output', 'agg', 'aggregate', 'all', 'any', 'apply', 'backfill', 'bfill', 'boxplot', 'corr', 'corrwith', 'count', 'cov', 'cumcount', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'dtypes', 'expanding', 'ffill', 'fillna', 'filter', 'first', 'get_group', 'groups', 'head', 'hist', 'idxmax', 'idxmin', 'indices', 'last', 'mad', 'max', 'mean', 'median', 'min', 'ndim', 'ngroup', 'ngroups', 'nth', 'nunique', 'ohlc', 'pad', 'pct_change', 'pipe', 'plot', 'prod', 'quantile', 'rank', 'resample', 'rolling', 'sample', 'sem', 'shift', 'size', 'skew', 'std', 'sum', 'tail', 'take', 'transform', 'tshift', 'var']

In [26]:
grouped.ngroups

112

In [27]:
groups = list(grouped.groups.keys())
groups[:6]

[('AK', 0), ('AK', 1), ('AL', 0), ('AL', 1), ('AR', 0), ('AR', 1)]

In [28]:
grouped.get_group(("FL", 1)).head()

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
712,The Baptist College of Florida,Graceville,FL,0.0,0.0,0.0,1,545.0,465.0,0.0,...,0.0308,0.0000,0.0507,0.2291,1,0.5878,0.5602,0.3531,30800,20052
713,Barry University,Miami,FL,0.0,0.0,0.0,1,470.0,462.0,0.0,...,0.0164,0.0741,0.0841,0.1518,1,0.5045,0.6733,0.4361,44100,28250
714,Gooding Institute of Nurse Anesthesia,Panama City,FL,0.0,0.0,0.0,1,NaN,NaN,0.0,...,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,PrivacySuppressed
715,Bethune-Cookman University,Daytona Beach,FL,1.0,0.0,0.0,1,405.0,395.0,0.0,...,0.0198,0.0205,0.0190,0.0523,1,0.7758,0.8867,0.0647,29400,36250
724,Johnson University Florida,Kissimmee,FL,0.0,0.0,0.0,1,480.0,470.0,0.0,...,0.0045,0.0045,0.0136,0.1636,1,0.6689,0.7384,0.2185,26300,20199

In [29]:
from IPython.display import display
for name, group in grouped:
    print(name)
    # display(group.head(3))

('AK', 0)
('AK', 1)
('AL', 0)
('AL', 1)
('AR', 0)
('AR', 1)
('AS', 0)
('AZ', 0)
('AZ', 1)
('CA', 0)
('CA', 1)
('CO', 0)
('CO', 1)
('CT', 0)
('CT', 1)
('DC', 0)
('DC', 1)
('DE', 0)
('DE', 1)
('FL', 0)
('FL', 1)
('FM', 0)
('GA', 0)
('GA', 1)
('GU', 0)
('GU', 1)
('HI', 0)
('HI', 1)
('IA', 0)
('IA', 1)
('ID', 0)
('ID', 1)
('IL', 0)
('IL', 1)
('IN', 0)
('IN', 1)
('KS', 0)
('KS', 1)
('KY', 0)
('KY', 1)
('LA', 0)
('LA', 1)
('MA', 0)
('MA', 1)
('MD', 0)
('MD', 1)
('ME', 0)
('ME', 1)
('MH', 0)
('MI', 0)
('MI', 1)
('MN', 0)
('MN', 1)
('MO', 0)
('MO', 1)
('MP', 0)
('MS', 0)
('MS', 1)
('MT', 0)
('MT', 1)
('NC', 0)
('NC', 1)
('ND', 0)
('ND', 1)
('NE', 0)
('NE', 1)
('NH', 0)
('NH', 1)
('NJ', 0)
('NJ', 1)
('NM', 0)
('NM', 1)
('NV', 0)
('NV', 1)
('NY', 0)
('NY', 1)
('OH', 0)
('OH', 1)
('OK', 0)
('OK', 1)
('OR', 0)
('OR', 1)
('PA', 0)
('PA', 1)
('PR', 0)
('PR', 1)
('PW', 0)
('RI', 0)
('RI', 1)
('SC', 0)
('SC', 1)
('SD', 0)
('SD', 1)
('TN', 0)
('TN', 1)
('TX', 0)
('TX', 1)
('UT', 0)
('UT', 1)
('VA', 0)
('VA', 1)
('VI', 0)
('VI', 1)
('VT', 0)
('VT', 1)
('WA', 0)
('WA', 1)
('WI', 0)
('WI', 1)
('WV', 0)
('WV', 1)
('WY', 0)

In [30]:
grouped.head(2).head(10)

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
10,Birmingham Southern College,Birmingham,AL,0.0,0.0,0.0,1,560.0,560.0,0.0,...,0.0051,0.0000,0.0051,0.0017,1,0.1920,0.4809,0.0152,44200,27000
43,Prince Institute-Southeast,Elmhurst,IL,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0000,0.0000,0.0000,0.0000,1,0.7857,0.9375,0.6569,PrivacySuppressed,20992
60,University of Alaska Anchorage,Anchorage,AK,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0980,0.0181,0.0457,0.4539,1,0.2385,0.2647,0.4386,42500,19449.5
61,Alaska Bible College,Palmer,AK,0.0,0.0,0.0,1,NaN,NaN,0.0,...,0.0370,0.0000,0.0000,0.1481,1,0.3571,0.2857,0.4286,NaN,PrivacySuppressed
62,University of Alaska Fairbanks,Fairbanks,AK,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0401,0.0110,0.3060,0.3887,1,0.2263,0.2550,0.4519,36200,19355
64,Alaska Pacific University,Anchorage,AK,0.0,0.0,0.0,1,555.0,503.0,0.0,...,0.0945,0.0000,0.0873,0.3745,1,0.3152,0.5297,0.4910,47000,23250
68,Everest College-Phoenix,Phoenix,AZ,0.0,0.0,0.0,1,NaN,NaN,0.0,...,0.0373,0.0000,0.1026,0.4749,0,0.8291,0.7151,0.6700,28600,9500

In [31]:
grouped.nth([1, -1]).head(8)

                                                  INSTNM        CITY  HBCU  \
STABBR RELAFFIL
AK     0                  University of Alaska Fairbanks   Fairbanks   0.0
       0                               Ilisagvik College      Barrow   0.0
       1                       Alaska Pacific University   Anchorage   0.0
       1                        Alaska Christian College    Soldotna   0.0
AL     0             University of Alabama at Birmingham  Birmingham   0.0
       0         Alabama College of Osteopathic Medicine      Dothan   0.0
       1                     Birmingham Southern College  Birmingham   0.0
       1            Strayer University-Huntsville Campus  Huntsville   NaN

                 MENONLY  WOMENONLY  SATVRMID  SATMTMID  DISTANCEONLY  \
STABBR RELAFFIL
AK     0             0.0        0.0       NaN       NaN           0.0
       0             0.0        0.0       NaN       NaN           0.0
       1             0.0        0.0     555.0     503.0           0.0
       1             0.0        0.0       NaN       NaN           0.0
AL     0             0.0        0.0     570.0     565.0           0.0
       0             0.0        0.0       NaN       NaN           0.0
       1             0.0        0.0     560.0     560.0           0.0
       1             NaN        NaN       NaN       NaN           NaN

                    UGDS  UGDS_WHITE  ...  UGDS_2MOR  UGDS_NRA  UGDS_UNKN  \
STABBR RELAFFIL                       ...
AK     0          5536.0      0.4259  ...     0.0401    0.0110     0.3060
       0           109.0      0.1376  ...     0.0000    0.0183     0.0000
       1           275.0      0.5309  ...     0.0945    0.0000     0.0873
       1            68.0      0.0588  ...     0.0147    0.0000     0.1324
AL     0         11383.0      0.5922  ...     0.0368    0.0179     0.0100
       0             NaN         NaN  ...        NaN       NaN        NaN
       1          1180.0      0.7983  ...     0.0051    0.0000     0.0051
       1             NaN         NaN  ...        NaN       NaN        NaN

                 PPTUG_EF  CURROPER  PCTPELL  PCTFLOAN  UG25ABV  \
STABBR RELAFFIL
AK     0           0.3887         1   0.2263    0.2550   0.4519
       0           0.6239         1   0.1323    0.0000   0.6498
       1           0.3745         1   0.3152    0.5297   0.4910
       1           0.0735         1   0.8868    0.6792   0.2264
AL     0           0.2607         1   0.3460    0.5214   0.2422
       0              NaN         1      NaN       NaN      NaN
       1           0.0017         1   0.1920    0.4809   0.0152
       1              NaN         1      NaN       NaN      NaN

                 MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
STABBR RELAFFIL
AK     0                   36200               19355
       0                   24900   PrivacySuppressed
       1                   47000               23250
       1                     NaN   PrivacySuppressed
AL     0                   39700             21941.5
       0                     NaN   PrivacySuppressed
       1                   44200               27000
       1                   49200             36173.5

[8 rows x 25 columns]

In [32]:
college = pd.read_csv("../data/college.csv", index_col = "INSTNM")
grouped = college.groupby("STABBR")
grouped.ngroups

59

In [33]:
college["STABBR"].nunique()

59

In [34]:
def check_minority(df, threshold):
    minority_pct = 1 - df["UGDS_WHITE"]
    total_minority = (df["UGDS"] * minority_pct).sum()
    total_ugds = df["UGDS"].sum()
    total_minority_pct = total_minority / total_ugds
    return total_minority_pct > threshold

college_filtered = grouped.filter(check_minority, threshold = .5)
college_filtered.head()

,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,UGDS,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,,,,,,,,,,,,,
Everest College-Phoenix,Phoenix,AZ,0.0,0.0,0.0,1,NaN,NaN,0.0,4102.0,...,0.0373,0.0,0.1026,0.4749,0,0.8291,0.7151,0.6700,28600,9500
Collins College,Phoenix,AZ,0.0,0.0,0.0,0,NaN,NaN,0.0,83.0,...,0.0241,0.0,0.3855,0.3373,0,0.7205,0.8228,0.4764,25700,47000
Empire Beauty School-Paradise Valley,Phoenix,AZ,0.0,0.0,0.0,1,NaN,NaN,0.0,25.0,...,0.0400,0.0,0.0000,0.1600,0,0.6349,0.5873,0.4651,17800,9588
Empire Beauty School-Tucson,Tucson,AZ,0.0,0.0,0.0,0,NaN,NaN,0.0,126.0,...,0.0000,0.0,0.0079,0.2222,1,0.7962,0.6615,0.4229,18200,9833
Thunderbird School of Global Management,Glendale,AZ,0.0,0.0,0.0,0,NaN,NaN,0.0,1.0,...,0.0000,0.0,0.0000,1.0000,0,0.0000,0.0000,0.0000,118900,PrivacySuppressed

In [35]:
college.shape

(7535, 26)

In [36]:
college_filtered.shape

(3028, 26)

In [37]:
college_filtered["STABBR"].nunique()

20

In [38]:
weight_loss = pd.read_csv("../data/weight_loss.csv")
weight_loss.query("Month == 'Jan'")

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
1  Amy   Jan  Week 1     197
2  Bob   Jan  Week 2     288
3  Amy   Jan  Week 2     189
4  Bob   Jan  Week 3     283
5  Amy   Jan  Week 3     189
6  Bob   Jan  Week 4     283
7  Amy   Jan  Week 4     190

In [39]:
def find_perc_loss(s):
    return (s - s.iloc[0]) / s.iloc[0]

bob_jan = weight_loss.query("Name == 'Bob' and Month == 'Jan'")
bob_jan

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
2  Bob   Jan  Week 2     288
4  Bob   Jan  Week 3     283
6  Bob   Jan  Week 4     283

In [40]:
find_perc_loss(bob_jan["Weight"])

0    0.000000
2   -0.010309
4   -0.027491
6   -0.027491
Name: Weight, dtype: float64

In [41]:
pcnt_loss = weight_loss.groupby(["Name", "Month"])["Weight"].transform(find_perc_loss)
pcnt_loss

0     0.000000
1     0.000000
2    -0.010309
3    -0.040609
4    -0.027491
5    -0.040609
6    -0.027491
7    -0.035533
8     0.000000
9     0.000000
10   -0.028269
11   -0.031579
12   -0.053004
13   -0.068421
14   -0.053004
15   -0.089474
16    0.000000
17    0.000000
18    0.011194
19    0.000000
20   -0.011194
21   -0.017341
22   -0.026119
23   -0.017341
24    0.000000
25    0.000000
26   -0.011494
27   -0.035294
28   -0.030651
29   -0.035294
30   -0.042146
31   -0.052941
Name: Weight, dtype: float64

In [42]:
weight_loss["Perc Weight Loss"] = pcnt_loss.round(3)
weight_loss.query("Name == 'Bob' and Month in ['Jan', 'Feb']")

   Name Month    Week  Weight  Perc Weight Loss
0   Bob   Jan  Week 1     291             0.000
2   Bob   Jan  Week 2     288            -0.010
4   Bob   Jan  Week 3     283            -0.027
6   Bob   Jan  Week 4     283            -0.027
8   Bob   Feb  Week 1     283             0.000
10  Bob   Feb  Week 2     275            -0.028
12  Bob   Feb  Week 3     268            -0.053
14  Bob   Feb  Week 4     268            -0.053

In [43]:
week4 = weight_loss.query("Week == 'Week 4'")
week4

   Name Month    Week  Weight  Perc Weight Loss
6   Bob   Jan  Week 4     283            -0.027
7   Amy   Jan  Week 4     190            -0.036
14  Bob   Feb  Week 4     268            -0.053
15  Amy   Feb  Week 4     173            -0.089
22  Bob   Mar  Week 4     261            -0.026
23  Amy   Mar  Week 4     170            -0.017
30  Bob   Apr  Week 4     250            -0.042
31  Amy   Apr  Week 4     161            -0.053

In [44]:
winner = week4.pivot(index = "Month", columns = "Name", values = "Perc Weight Loss")
winner

Name     Amy    Bob
Month
Apr   -0.053 -0.042
Feb   -0.089 -0.053
Jan   -0.036 -0.027
Mar   -0.017 -0.026

In [45]:
import numpy as np

winner["Winner"] = np.where(winner["Amy"] < winner["Bob"], "Amy", "Bob")
winner.style.highlight_min(axis = 1)

In [46]:
winner.Winner.value_counts()

Amy    3
Bob    1
Name: Winner, dtype: int64

In [47]:
college = pd.read_csv("../data/college.csv")
subset = ["UGDS", "SATMTMID", "SATVRMID"]
college2 = college.dropna(subset = subset)
college.shape

(7535, 27)

In [48]:
college2.shape

(1184, 27)

In [49]:
def weighted_math_average(df):
    weighted_math = df["UGDS"] * df["SATMTMID"]
    return int(weighted_math.sum() / df["UGDS"].sum())

college2.groupby("STABBR").apply(weighted_math_average).head()

STABBR
AK    503
AL    536
AR    529
AZ    569
CA    564
dtype: int64

In [50]:
from scipy.stats import gmean, hmean
def calculate_means(df):
    df_means = pd.DataFrame(index=['Arithmetic', 'Weighted', 'Geometric', 'Harmonic'])
    cols = ['SATMTMID', 'SATVRMID']
    for col in cols:
        arithmetic = df[col].mean()
        weighted = np.average(df[col], weights=df['UGDS'])
        geometric = gmean(df[col])
        harmonic = hmean(df[col])
        df_means[col] = [arithmetic, weighted, geometric, harmonic]
        
    df_means['count'] = len(df)
    return df_means.astype(int)

college2.groupby('STABBR').filter(lambda x: len(x) != 1).groupby('STABBR').apply(calculate_means).head(10)

                   SATMTMID  SATVRMID  count
STABBR
AL     Arithmetic       504       508     21
       Weighted         536       533     21
       Geometric        500       505     21
       Harmonic         497       502     21
AR     Arithmetic       515       491     16
       Weighted         529       504     16
       Geometric        514       489     16
       Harmonic         513       487     16
AZ     Arithmetic       536       538      6
       Weighted         569       557      6

In [51]:
flights.head()

,MONTH,DAY,WEEKDAY,AIRLINE,ORG_AIR,DEST_AIR,SCHED_DEP,DEP_DELAY,AIR_TIME,DIST,SCHED_ARR,ARR_DELAY,DIVERTED,CANCELLED
0,1,1,4,WN,LAX,SLC,1625,58.0,94.0,590,1905,65.0,0,0
1,1,1,4,UA,DEN,IAD,823,7.0,154.0,1452,1333,-13.0,0,0
2,1,1,4,MQ,DFW,VPS,1305,36.0,85.0,641,1453,35.0,0,0
3,1,1,4,AA,DFW,DCA,1555,7.0,126.0,1192,1935,-7.0,0,0
4,1,1,4,WN,LAX,MCI,1720,48.0,166.0,1363,2225,39.0,0,0

In [52]:
bins = [-np.inf, 200, 500, 1000, 2000, np.inf]
cuts = pd.cut(flights['DIST'], bins=bins)
cuts.head()

0     (500.0, 1000.0]
1    (1000.0, 2000.0]
2     (500.0, 1000.0]
3    (1000.0, 2000.0]
4    (1000.0, 2000.0]
Name: DIST, dtype: category
Categories (5, interval[float64]): [(-inf, 200.0] < (200.0, 500.0] < (500.0, 1000.0] < (1000.0, 2000.0] < (2000.0, inf]]

In [53]:
cuts.value_counts()

(500.0, 1000.0]     20659
(200.0, 500.0]      15874
(1000.0, 2000.0]    14186
(2000.0, inf]        4054
(-inf, 200.0]        3719
Name: DIST, dtype: int64

In [54]:
flights.groupby(cuts)['AIRLINE'].value_counts(normalize=True).round(3).head(15)

DIST            AIRLINE
(-inf, 200.0]   OO         0.326
                EV         0.289
                MQ         0.211
                DL         0.086
                AA         0.052
                UA         0.027
                WN         0.009
(200.0, 500.0]  WN         0.194
                DL         0.189
                OO         0.159
                EV         0.156
                MQ         0.100
                AA         0.071
                UA         0.062
                VX         0.028
Name: AIRLINE, dtype: float64

In [55]:
flights.groupby(cuts)['AIR_TIME'].quantile(q=[.25, .5, .75]).div(60).round(2)

DIST
(-inf, 200.0]     0.25    0.43
                  0.50    0.50
                  0.75    0.57
(200.0, 500.0]    0.25    0.77
                  0.50    0.92
                  0.75    1.05
(500.0, 1000.0]   0.25    1.43
                  0.50    1.65
                  0.75    1.92
(1000.0, 2000.0]  0.25    2.50
                  0.50    2.93
                  0.75    3.40
(2000.0, inf]     0.25    4.30
                  0.50    4.70
                  0.75    5.03
Name: AIR_TIME, dtype: float64

In [56]:
labels=['Under an Hour', '1 Hour', '1-2 Hours', '2-4 Hours', '4+ Hours']
cuts2 = pd.cut(flights['DIST'], bins=bins, labels=labels)
flights.groupby(cuts2)['AIRLINE'].value_counts(normalize=True).round(3).unstack().style.highlight_max(axis=1)

In [57]:
cuts2.head()

0    1-2 Hours
1    2-4 Hours
2    1-2 Hours
3    2-4 Hours
4    2-4 Hours
Name: DIST, dtype: category
Categories (5, object): ['Under an Hour' < '1 Hour' < '1-2 Hours' < '2-4 Hours' < '4+ Hours']

In [58]:
cuts2.value_counts()

1-2 Hours        20659
1 Hour           15874
2-4 Hours        14186
4+ Hours          4054
Under an Hour     3719
Name: DIST, dtype: int64

In [59]:
flights_ct = flights.groupby(['ORG_AIR', 'DEST_AIR']).size()
flights_ct.head()

ORG_AIR  DEST_AIR
ATL      ABE         31
         ABQ         16
         ABY         19
         ACY          6
         AEX         40
dtype: int64

In [60]:
flights_sort = flights[['ORG_AIR', 'DEST_AIR']].apply(sorted, axis=1)
flights_sort

0        [LAX, SLC]
1        [DEN, IAD]
2        [DFW, VPS]
3        [DCA, DFW]
4        [LAX, MCI]
            ...
58487    [DFW, SFO]
58488    [LAS, SFO]
58489    [SBA, SFO]
58490    [ATL, MSP]
58491    [BOI, SFO]
Length: 58492, dtype: object

In [61]:
s = pd.Series([1, 1, 1, 0, 1, 1, 1, 0])
s

0    1
1    1
2    1
3    0
4    1
5    1
6    1
7    0
dtype: int64

In [62]:
s1 = s.cumsum()
s1

0    1
1    2
2    3
3    3
4    4
5    5
6    6
7    6
dtype: int64

In [63]:
s.mul(s1).diff()

0    NaN
1    1.0
2    1.0
3   -3.0
4    4.0
5    1.0
6    1.0
7   -6.0
dtype: float64

In [64]:
s.mul(s1).diff().where(lambda x: x < 0)

0    NaN
1    NaN
2    NaN
3   -3.0
4    NaN
5    NaN
6    NaN
7   -6.0
dtype: float64

In [65]:
s.mul(s1).diff().where(lambda x: x < 0).ffill().add(s1, fill_value=0)

0    1.0
1    2.0
2    3.0
3    0.0
4    1.0
5    2.0
6    3.0
7    0.0
dtype: float64

In [66]:
flights = pd.read_csv('../data/flights.csv')
flights['ON_TIME'] = flights['ARR_DELAY'].lt(15).astype(int)
flights[['AIRLINE', 'ORG_AIR', 'ON_TIME']].head(10)

  AIRLINE ORG_AIR  ON_TIME
0      WN     LAX        0
1      UA     DEN        1
2      MQ     DFW        0
3      AA     DFW        1
4      WN     LAX        0
5      UA     IAH        1
6      AA     DFW        0
7      F9     SFO        1
8      AA     ORD        1
9      UA     IAH        1

In [67]:
def max_streak(s):
    s1 = s.cumsum()
    return s.mul(s1).diff().where(lambda x: x < 0).ffill().add(s1, fill_value=0).max()

flights.sort_values(['MONTH', 'DAY', 'SCHED_DEP']) \
       .groupby(['AIRLINE', 'ORG_AIR'])['ON_TIME'] \
       .agg(['mean', 'size', max_streak]).round(2).head()

                 mean  size  max_streak
AIRLINE ORG_AIR
AA      ATL      0.82   233          15
        DEN      0.74   219          17
        DFW      0.78  4006          64
        IAH      0.80   196          24
        LAS      0.79   374          29